app/controllers/users_controller.rb

   def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$4/KqzTjt5Ay7.q08ZHHVA.fDPqBGlmRO1uqMxQ49BSgavROTtujuK', "remember_token" = 'SkPBYWQmyf2xiz644AXmag', "updated_at" = '2012-04-03 09:37:06.849393' WHERE "users"."id" = 1